Action requested by https://github.com/pretf/example-project/pull/1#issuecomment-608543367 is complete!

# vpc/dev

```diff
[pretf] link: stack.tf.py vpc.auto.tfvars.py
[pretf] module: claranet/vpc-modules/aws//modules/vpc 1.1.0
[pretf] link: README.md main.tf outputs.tf variables.tf
[pretf] create: stack.tf.json vpc.auto.tfvars.json
[pretf] run: terraform plan -input=false -no-color -out=tfplan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.aws_region.current: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_default_route_table.vpc will be created
  + resource "aws_default_route_table" "vpc" {
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name" = "pretf-example-project-dev"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "pretf-example-project-dev"
        }
      + vpc_id   = (known after apply)
    }

  # aws_vpc.vpc will be created
  + resource "aws_vpc" "vpc" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.1.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "pretf-example-project-dev"
        }
    }

  # aws_vpc_dhcp_options.vpc will be created
  + resource "aws_vpc_dhcp_options" "vpc" {
      + domain_name         = "eu-west-1.compute.internal"
      + domain_name_servers = [
          + "AmazonProvidedDNS",
        ]
      + id                  = (known after apply)
      + owner_id            = (known after apply)
      + tags                = {
          + "Name" = "pretf-example-project-dev"
        }
    }

  # aws_vpc_dhcp_options_association.vpc_dhcp will be created
  + resource "aws_vpc_dhcp_options_association" "vpc_dhcp" {
      + dhcp_options_id = (known after apply)
      + id              = (known after apply)
      + vpc_id          = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
[pretf] clean: README.md main.tf outputs.tf stack.tf.json stack.tf.py variables.tf vpc.auto.tfvars.json vpc.auto.tfvars.py
```

# vpc/prod

```diff
[pretf] link: stack.tf.py vpc.auto.tfvars.py
[pretf] module: claranet/vpc-modules/aws//modules/vpc 1.1.0
[pretf] link: README.md main.tf outputs.tf variables.tf
[pretf] create: stack.tf.json vpc.auto.tfvars.json
[pretf] run: terraform plan -input=false -no-color -out=tfplan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.aws_region.current: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_default_route_table.vpc will be created
  + resource "aws_default_route_table" "vpc" {
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name" = "pretf-example-project-prod"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "pretf-example-project-prod"
        }
      + vpc_id   = (known after apply)
    }

  # aws_vpc.vpc will be created
  + resource "aws_vpc" "vpc" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.3.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "pretf-example-project-prod"
        }
    }

  # aws_vpc_dhcp_options.vpc will be created
  + resource "aws_vpc_dhcp_options" "vpc" {
      + domain_name         = "eu-west-1.compute.internal"
      + domain_name_servers = [
          + "AmazonProvidedDNS",
        ]
      + id                  = (known after apply)
      + owner_id            = (known after apply)
      + tags                = {
          + "Name" = "pretf-example-project-prod"
        }
    }

  # aws_vpc_dhcp_options_association.vpc_dhcp will be created
  + resource "aws_vpc_dhcp_options_association" "vpc_dhcp" {
      + dhcp_options_id = (known after apply)
      + id              = (known after apply)
      + vpc_id          = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
[pretf] clean: README.md main.tf outputs.tf stack.tf.json stack.tf.py variables.tf vpc.auto.tfvars.json vpc.auto.tfvars.py
```

# vpc/stage

```diff
[pretf] link: stack.tf.py vpc.auto.tfvars.py
[pretf] module: claranet/vpc-modules/aws//modules/vpc 1.1.0
[pretf] link: README.md main.tf outputs.tf variables.tf
[pretf] create: stack.tf.json vpc.auto.tfvars.json
[pretf] run: terraform plan -input=false -no-color -out=tfplan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.aws_region.current: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_default_route_table.vpc will be created
  + resource "aws_default_route_table" "vpc" {
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name" = "pretf-example-project-stage"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_internet_gateway.igw will be created
  + resource "aws_internet_gateway" "igw" {
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "pretf-example-project-stage"
        }
      + vpc_id   = (known after apply)
    }

  # aws_vpc.vpc will be created
  + resource "aws_vpc" "vpc" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.2.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "pretf-example-project-stage"
        }
    }

  # aws_vpc_dhcp_options.vpc will be created
  + resource "aws_vpc_dhcp_options" "vpc" {
      + domain_name         = "eu-west-1.compute.internal"
      + domain_name_servers = [
          + "AmazonProvidedDNS",
        ]
      + id                  = (known after apply)
      + owner_id            = (known after apply)
      + tags                = {
          + "Name" = "pretf-example-project-stage"
        }
    }

  # aws_vpc_dhcp_options_association.vpc_dhcp will be created
  + resource "aws_vpc_dhcp_options_association" "vpc_dhcp" {
      + dhcp_options_id = (known after apply)
      + id              = (known after apply)
      + vpc_id          = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
[pretf] clean: README.md main.tf outputs.tf stack.tf.json stack.tf.py variables.tf vpc.auto.tfvars.json vpc.auto.tfvars.py
```

You can check the [execution log](https://github.com/pretf/example-project/actions/runs/70020024) to learn more!